In [1]:
import warnings
warnings.filterwarnings('ignore')

import numpy as np
import pandas as pd

In [2]:
# Create a dictionary with three keys, 'A', 'B', and 'C', and lists of 10 numbers as values
data = {'A': list(range(10)),
        'B': list(range(10, 20)),
        'C': list(range(20, 30))}

# Convert the dictionary to a pandas DataFrame
df1 = pd.DataFrame(data)

# Print the DataFrame
df = df1.head()
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [3]:
df.loc[1, 'A']

1

In [4]:
df.loc[1, 'B']

11

In [5]:
df.loc[:, 'A']

0    0
1    1
2    2
3    3
4    4
Name: A, dtype: int64

In [6]:
df.loc[:, 'B']

0    10
1    11
2    12
3    13
4    14
Name: B, dtype: int64

In [7]:
df.loc[[1,2], 'B']

1    11
2    12
Name: B, dtype: int64

In [8]:
df.loc[:2, 'B']

0    10
1    11
2    12
Name: B, dtype: int64

In [9]:
df.loc[::-1,  ::-2]

    C  A
4  24  4
3  23  3
2  22  2
1  21  1
0  20  0

In [10]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [11]:
df.loc[df['A'] < 3]

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22

In [12]:
df.loc[df['B'] < 199]

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [13]:
df.loc[(df['B'] < 19) & (df['B'] > 2)]

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [14]:
df.loc[(df['B'] < 19) | (df['B'] > 2)]

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [15]:
df.loc[df['C'] > 21]

   A   B   C
2  2  12  22
3  3  13  23
4  4  14  24

In [16]:
df.loc[3, 'B'] = 50

In [17]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  50  23
4  4  14  24

In [18]:
df.loc[df['A']%2 ==0]

   A   B   C
0  0  10  20
2  2  12  22
4  4  14  24

In [20]:
# How would you use loc to set all values in column 'C' to 100 where column 'B' is greater than 15?

In [21]:
df.loc[df['B'] > 15, 'C'] = 100

In [22]:
df.loc[df['A'] <2, 'B']  = 200

In [24]:
df.loc[df['C'] == 100, 'A']

3    3
Name: A, dtype: int64

In [34]:
df.loc[df['B']< 15, 'B'] = -1

In [35]:
df.loc[:, 'B']

0    200
1    200
2     -1
3     50
4     -1
Name: B, dtype: int64

In [36]:
df.loc[df['B']<10]

   A  B  C    N
2 -1 -1 -1 -1.0
4 -1 -1 -1 -1.0

In [37]:
df

   A    B    C    N
0  0  200   20  NaN
1  1  200   21  NaN
2 -1   -1   -1 -1.0
3  3   50  100  NaN
4 -1   -1   -1 -1.0

In [39]:
df.loc[(df['A'] ==2) | (df['A'] == 3)]

   A   B    C   N
3  3  50  100 NaN

In [ ]:
df.loc[df['A']%2 ==0, 'C'] = 0